section .data
    ; Секрет для шифрования.
    ; Объявляем глобальный символ, чтобы его можно было использовать
    encryption_key db 0x5A


section .text
    global asm_encrypt

; Функция: asm_encrypt(char* data, int length)
asm_encrypt:
    ; Проверяем, не равна ли длина строки нулю
    cmp rsi, 0
    jle .done

    xor rcx, rcx                ; Очищаем регистр-счетчик RCX (индекс символа)

.loop:
    ; --- НИЗКОУРОВНЕВАЯ PIC-АДРЕСАЦИЯ ---
    ; Мы не можем написать: mov al, [encryption_key]
    ; Мы обязаны использовать адресацию относительно указателя команд RIP!
    mov al, [rel encryption_key] ; Процессор рассчитывает адрес на лету относительно RIP

    ; Берем текущий символ строки (адрес строки в RDI + индекс в RCX)
    xor byte [rdi + rcx], al    ; Применяем операцию XOR с ключом

    inc rcx                     ; Переходим к следующему символу
    cmp rcx, rsi                ; Сравниваем текущий индекс с длиной строки
    jl .loop                    ; Если индекс меньше длины — крутим цикл дальше

.done:
    ret                         ; Возврат управления в вызывающую программу